In [12]:
import requests
import pandas as pd
import time

API_KEY = '9103635b57deb827ae5d52f492cfdc68'
BASE_URL = 'http://api.openweathermap.org/data/2.5/weather?'
# url = 'https://api.openweathermap.org/data/3.0/onecall?lat={-0.2856}&lon={36.0757}&appid={186ce27344ed40c9a4a164814250806}'
# url = 'https://api.weatherapi.com/v1/current.json?key=186ce27344ed40c9a4a164814250806&q=Nakuru&aqi=no'
# response = requests.get(url)
kenyan_cities = ["Nairobi", "Mombasa", "Kisumu", "Nakuru", "Eldoret"]

In [13]:
# Initialize list to store weather data
weather_data = []

In [14]:
print(weather_data)

[]

In [15]:
import pandas as pd
kenyan_cities

['Nairobi', 'Mombasa', 'Kisumu', 'Nakuru', 'Eldoret']

In [16]:
for city in kenyan_cities:
   params = {
       'q': city,
       'appid': API_KEY,
       'units': 'metric'
   }
   response = requests.get(BASE_URL, params=params)

   if response.status_code == 200:
       data = response.json()
       weather_data.append({
           'city': city,
           'temperature': data['main']['temp'],
           'humidity': data['main']['humidity'],
           'pressure': data['main']['pressure'],
           'wind_speed': data['wind']['speed']
       })
   else:
       print(f"Failed to get data for {city}")

   # Pause to avoid hitting API rate limit
   time.sleep(1)

In [17]:
weather_df = pd.DataFrame(weather_data)

In [18]:
weather_df

      city  temperature  humidity  pressure  wind_speed
0  Nairobi        18.43        67      1016        3.58
1  Mombasa        24.85        84      1015        6.09
2   Kisumu        20.62        80      1013        1.47
3   Nakuru        15.98        83      1017        3.70
4  Eldoret        14.47        84      1015        1.20